In [1]:
%run "../app/dreams"


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
df = dreams_mastersheet

In [3]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [4]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

19682

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           929     816     731     375           5083         7934
15-19          1013     711     453     266           5313         7756
20-24           522     343     201     113           2813         3992
Grand Total    2464    1870    1385     754          13209        19682

In [5]:
base18plus = df[
    (df.newage_range!="not_valid_age")
    &(df.newage_range!="25-29")
    &(df.newage_range!="10-17")
    &(df.timeOn_system=="required_Time_on")
]
base18plus.code.count()
base18plus_table = base18plus.pivot_table(index="newage_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base18plus_table

6574

fiscal_year   FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
newage_range
18-19            346     241     141      76           1778         2582
20-24            522     343     201     113           2813         3992
Grand Total      868     584     342     189           4591         6574

# curriculum

In [6]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

16517

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           743     626     618     274           4352         6613
15-19           818     535     384     230           4546         6513
20-24           413     274     152      92           2460         3391
Grand Total    1974    1435    1154     596          11358        16517

In [7]:
curriculum_inc = base[
    (base.dreams_curriculum=="curriculum_inc")
]
curriculum_inc.code.count()

curriculum_inc_table = curriculum_inc.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_inc_table

3165

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           186     190     113     101            731         1321
15-19           195     176      69      36            767         1243
20-24           109      69      49      21            353          601
Grand Total     490     435     231     158           1851         3165

# Condoms

In [8]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3373

3750

In [9]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            83     100      45      25            221          474
15-19           308     173     132      94            986         1693
20-24           240      94      58      41            773         1206
Grand Total     631     367     235     160           1980         3373

In [10]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            86     105      95      61            258          605
15-19           337     218     163     104           1046         1868
20-24           258     123      65      42            789         1277
Grand Total     681     446     323     207           2093         3750

# depistage VIH

In [11]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

2031

In [12]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            34      10      20       1            385          450
15-19            93      26      27       7            661          814
20-24           155      27      32      10            543          767
Grand Total     282      63      79      18           1589         2031

# Post Care Treatment

In [13]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

97

In [14]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year  FY21Q1  FY21Q2  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0       0             16           19
15-19             3       1       1             38           43
20-24             0       0       0             35           35
Grand Total       6       1       1             89           97

# socio economique Approche

In [15]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

combin_socio_eco.code.count()

530

In [16]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       0       1            152          154
15-19             4       1       0            173          178
20-24             1       0       0            197          198
Grand Total       6       1       1            522          530

# PREP

In [17]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

567

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             2       1       6       0             14           23
15-19            49      17      38       4             91          199
20-24           117      18      34       7            169          345
Grand Total     168      36      78      11            274          567

In [18]:
prep_accept = base[
    (base.acc_prep=="accept")
]
prep_accept.code.count()
prep_accept_table = prep_accept.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_accept_table

49

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       0       2             13           21
20-24             8       3       1       0             12           24
Grand Total      14       3       1       2             29           49

In [19]:
prep_ref = base[
    (base.ref_prep=="tested_on_given_date")
]
prep_ref.code.count()
prep_ref_table = prep_ref.pivot_table(
                        index="age_range",
                        columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_ref_table

47

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       0       1             12           19
20-24             8       3       1       0             12           24
Grand Total      14       3       1       1             28           47

In [20]:

prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

44

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0       0       0              4            4
15-19             6       0       0       1             11           18
20-24             8       3       1       0             10           22
Grand Total      14       3       1       1             25           44

In [21]:

prep_accept[prep_accept.code.isin(prep_ref.code)].code.count()
prep_accept[~prep_accept.code.isin(prep_ref.code)].code.count()

accepter_non_referer = prep_accept[~prep_accept.code.isin(prep_ref.code)]

43

6

In [22]:
prep_ref[prep_ref.code.isin(prep_accept.code)].code.count()
prep_ref[~prep_ref.code.isin(prep_accept.code)].code.count()


ref_non_accept = prep_ref[~prep_ref.code.isin(prep_accept.code)]

43

4

In [23]:
prep_ref[prep_ref.code.isin(prep.code)].code.count()
prep_ref[~prep_ref.code.isin(prep.code)].code.count()

43

4

In [24]:
prep[prep.code.isin(prep_ref.code)].code.count()
prep[~prep.code.isin(prep_ref.code)].code.count()

43

1

In [25]:

search_missing_prep = pd.ExcelWriter(f"find_missing_prep.xlsx",engine="xlsxwriter")

accepter_non_referer.to_excel(search_missing_prep,sheet_name="accepter_non_referer",index=True,na_rep="NULL")
ref_non_accept.to_excel(search_missing_prep,sheet_name="ref_non_accept",index=True,na_rep="NULL")
search_missing_prep.save()

# jardinage

In [26]:


garden = base[
    (base.is_gardening=="yes")
]
garden.code.count()

garden_table = garden.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
garden_table

478

fiscal_year  FY21Q1  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       0       1            147          149
15-19             4       1       0            159          164
20-24             1       0       0            164          165
Grand Total       6       1       1            470          478

# MUSO

In [27]:
muso = base[
    (base.is_muso=="yes")
]
muso.code.count()

muso_table = muso.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
muso_table

65

fiscal_year  Q3fy20-Q4fy20  Grand Total
age_range
10-14                    5            5
15-19                   16           16
20-24                   44           44
Grand Total             65           65

# Primary Services

In [28]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6613

1661

1140

In [29]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           743     626     618     274           4352         6613
Grand Total     743     626     618     274           4352         6613

In [30]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
15-19           305     172     155      82            947         1661
Grand Total     305     172     155      82            947         1661

In [31]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
20-24           230      99      51      31            729         1140
Grand Total     230      99      51      31            729         1140

# reporting

In [32]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()